In [3]:
person = {
    "first": ["Corey", "Omer", "Maryam", "Omer"],
    "last": ["Shafter", "Shehzad","Rana","Shapoki"],
    "email":["cs@gmail.com", "os@gmail.com", "mr@gmail.com","oshapoki@gmail.com"]
}

In [4]:
import pandas as pd

df = pd.DataFrame(person)
df

    first     last               email
0   Corey  Shafter        cs@gmail.com
1    Omer  Shehzad        os@gmail.com
2  Maryam     Rana        mr@gmail.com
3    Omer  Shapoki  oshapoki@gmail.com

In [5]:
df.columns = ['first name', 'last name', 'email']
df.columns = [x.upper() for x in df.columns]
df

  FIRST NAME LAST NAME               EMAIL
0      Corey   Shafter        cs@gmail.com
1       Omer   Shehzad        os@gmail.com
2     Maryam      Rana        mr@gmail.com
3       Omer   Shapoki  oshapoki@gmail.com

In [6]:
df.columns = df.columns.str.replace(' ', '_')
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name               email
0      Corey   Shafter        cs@gmail.com
1       Omer   Shehzad        os@gmail.com
2     Maryam      Rana        mr@gmail.com
3       Omer   Shapoki  oshapoki@gmail.com

In [7]:
df1 = df.rename(columns={'first_name': 'first', 'last_name': 'last'})
df1

    first     last               email
0   Corey  Shafter        cs@gmail.com
1    Omer  Shehzad        os@gmail.com
2  Maryam     Rana        mr@gmail.com
3    Omer  Shapoki  oshapoki@gmail.com

In [8]:
# change row = last name
df.loc[2, ['first_name','last_name', 'email']] = ['Maryam', 'Rana', 'mr@gmail.com']
df

  first_name last_name               email
0      Corey   Shafter        cs@gmail.com
1       Omer   Shehzad        os@gmail.com
2     Maryam      Rana        mr@gmail.com
3       Omer   Shapoki  oshapoki@gmail.com

In [9]:
df.loc[0, 'first_name'] = 'Gray'
df

  first_name last_name               email
0       Gray   Shafter        cs@gmail.com
1       Omer   Shehzad        os@gmail.com
2     Maryam      Rana        mr@gmail.com
3       Omer   Shapoki  oshapoki@gmail.com

In [11]:
# The format for loc and iloc is that first it will have rows and columns:
# loc[[row1, row2,...], [col1, col2,...]]

df.iloc[[0,1], [2]]                 # get first 2 rows from email
df.loc[[0,1], ['last_name','email']]     # get first 2 rows from last and email columns

  last_name         email
0   Shafter  cs@gmail.com
1   Shehzad  os@gmail.com

In [12]:
# set index and reset index command - but not needed here:

#df.set_index('email', inplace  = True)
#df.reset_index(drop=True, inplace = True)
#df

In [15]:
# filter rows where name = 'Omer'

name_omer = (df['first_name'] == 'Omer')
df.loc[name_omer, ['email', 'last_name']]

                email last_name
1        os@gmail.com   Shehzad
3  oshapoki@gmail.com   Shapoki

In [23]:
# Ampersand '&' is an 'AND'
#shapokis = ((df['first_name'] == 'Omer') & (df['last_name'] == 'Shapoki'))
#shapokis

# Pipe '|' is an 'OR'
poochies = ((df['first_name'] == 'Omer') | (df['last_name'] == 'Rana'))
df[poochies]

  first_name last_name               email
1       Omer   Shehzad        os@gmail.com
2     Maryam      Rana        mr@gmail.com
3       Omer   Shapoki  oshapoki@gmail.com

In [ ]:
# convert email to upper case permanently
df['email'] = df['email'].str.upper()
df

  first_name last_name               email
0       Gray   Shafter        CS@GMAIL.COM
1       Omer   Shehzad        OS@GMAIL.COM
2     Maryam      Rana        MR@GMAIL.COM
3       Omer   Shapoki  OSHAPOKI@GMAIL.COM

Apply Function Below:

In [28]:
# apply, reapply, replace
df['email'].apply(len)

0    12
1    12
2    12
3    18
Name: email, dtype: int64

In [35]:
def update_email(email):
    return email.lower()

df['email'] = df['email'].apply(update_email)
df

  first_name last_name               email
0       Gray   Shafter        cs@gmail.com
1       Omer   Shehzad        os@gmail.com
2     Maryam      Rana        mr@gmail.com
3       Omer   Shapoki  oshapoki@gmail.com

In [ ]:
# lambda function - same as above
df['email'] = df['email'].apply(lambda x: x.lower())
df

  first_name last_name               email
0       Gray   Shafter        cs@gmail.com
1       Omer   Shehzad        os@gmail.com
2     Maryam      Rana        mr@gmail.com
3       Omer   Shapoki  oshapoki@gmail.com

In [50]:
# Apply on a df:
#len(df.iloc[2,1]) - give length of row 3 and column 1

df.apply(pd.Series.max)

first_name                  Omer
last_name                Shehzad
email         oshapoki@gmail.com
dtype: object

ApplyMap below:

In [53]:
df.applymap(len)

C:\Users\Maryam Asghar\AppData\Local\Temp\ipykernel_13792\1485728669.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   first_name  last_name  email
0           4          7     12
1           4          7     12
2           6          4     12
3           4          7     18